[

    {
        "name" : {
            "id": 6,
            "img": "Dishes Images/Fish Curry.jpg",
            "Dish": "Fish Curry",
            "Dishname": "Fish_Curry",
            "typeofDish": "Non-Veg",
            "preparationTime": "15 minutes",
            "cockingTime": "30 minutes ",
            "totalTime": "45 minutes ",
            "Serving": "4 servings",
            "ingredients": "500g fish fillets (such as kingfish, tilapia, or cod), 1 teaspoon turmeric powder, 1 teaspoon red chili powder, 1 tablespoon lemon juice, 2 tablespoons oil (coconut oil or vegetable oil),1 large onion, finely chopped, 2 tomatoes, finely chopped or pureed, 1 tablespoon ginger-garlic paste,1 teaspoon cumin seed, 1 teaspoon mustard seeds, 2-3 green chilies (slit), 1 teaspoon turmeric powder, 1 teaspoon coriander powder, 1 teaspoon red chili powder, 1 teaspoon garam masala, 1/2 cup coconut milk (optional), 2 tablespoons tamarind pastes or juice, Fresh coriander leaves for garnish, Salt to taste.",
            "instructions": [
                " In a bowl, mix the turmeric powder, red chili powder, lemon juice, and salt. Coat the fish fillets with this mixture and let them marinate for 15 minutes.",
                " Heat 1 tablespoon oil in a pan and lightly fry the marinated fish for 2-3 minutes on each side until golden brown. Remove from the pan and set aside. ",
                "In the same pan, heat the remaining oil. Add mustard seeds and cumin seeds, and let them splutter. Add chopped onions and sauté until golden brown. Add ginger-garlic paste and cook until the raw smell disappears.Add chopped tomatoes (or tomato puree) and cook until the oil separates from the mixture. Add turmeric powder, coriander powder, red chili powder, and garam masala. Cook for another 2 minutes.",
                " Add the tamarind paste and a cup of water. Bring the curry to a boil and then lower the heat to let it simmer for 10 minutes. If using coconut milk, add it at this stage and mix well.",
                " Gently slide the fried fish fillets into the curry. Simmer for 5-7 minutes on low heat, allowing the fish to absorb the Flavors of the curry. ",
                "Garnish with fresh coriander leaves. Serve hot with steamed rice or roti. "
            ],
            "nurtrition": {
                "Calories":"320 kcal",
                "Protein":" 30g",
                "Fat":"15g",
                "Fiber":"3g",
                "Carbohydrates":"10g"
            }
        }
    }

    

]