[

    {
        "id": 10,
        "img": "Dishes Images/mutton Rogan josh.jpg",
        "Dish": "Mutton Rogan Josh",
        "Dishname": "Mutton_Rogan_Josh",
        "typeofDish": "Non-Veg",
        "preparationTime": "20 minutes ",
        "cockingTime": "1 hour 30 minutes ",
        "totalTime": "1 hour 50 minutes ",
        "Serving": "4 servings",
        "ingredients": "500g mutton (goat or lamb, cut into medium pieces), 2 tablespoons mustard oil (or vegetable oil), 1 large onion, finely sliced, 1 tablespoon ginger-garlic paste, 1/2 cup plain yogurt (whisked), 2-3 green cardamom pods, 2-3 cloves, 1 bay leaf, 1 cinnamon stick, 1/2 teaspoon cumin seeds,1 teaspoon red chili powder (preferably Kashmiri red chili powder for color), 1 teaspoon ground coriander, 1/2 teaspoon turmeric powder,1/2 teaspoon fennel powder, 1/2 teaspoon garam masala, 2-3 tablespoons water, Fresh coriander leaves for garnish Salt to taste. ",
        "instructions": [
            " Heat mustard oil in a large heavy-bottomed pan or pressure cooker over medium heat. Add the cumin seeds, cardamom pods, cloves, bay leaf, and cinnamon stick. Let them sizzle for a minute until fragrant. Add the sliced onions and sauté until golden brown. ",
            "Add the ginger-garlic paste to the onions and cook for another 2-3 minutes until the raw smell disappears. Stir in the red chili powder, ground coriander, turmeric powder, and fennel powder. Add the mutton pieces and sear them on all sides until they turn brown, about 8-10 minutes. ",
            "Lower the heat and add the whisked yogurt, a little at a time, stirring continuously to prevent curdling. Cook the mutton in the yogurt and spices for about 10-15 minutes, allowing the yogurt to thicken.",
            "Add 2-3 tablespoons of water, cover the pan, and let the mutton cook on low heat for 1-1.5 hours until the meat is tender and the oil starts separating from the gravy.",
            "If using a pressure cooker, cook for 5-6 whistles until the mutton is tender. Stir occasionally and add more water if needed to adjust the gravy's consistency. ",
            "Stir in the garam masala and cook for another 5 minutes. Garnish with fresh coriander leaves. Serve hot with steamed rice, naan, or roti. "
        ],
        "nurtrition": {
            "Calories":"450 kcal",
            "Protein":" 30g",
            "Fat":"25g",
            "Fiber":"2g",
            "Carbohydrates":"10g"
        }
    }

]