[

    {
        "name" : {
            "id": 3,
            "img": "Dishes Images/palak chicken.jpg",
            "Dish": "Palak Chicken",
            "Dishname": "Palak_Chicken",
            "typeofDish": "Non-Veg",
            "preparationTime": "10 minutes ",
            "cockingTime": "40 minutes ",
            "totalTime": "50 minutes ",
            "Serving": "4 servings",
            "inngredients": "500g chicken (bone-in or boneless, cut into pieces), 1 tablespoon ginger-garlic paste, 1 teaspoon turmeric powder, 1 teaspoon red chili powder,1 teaspoon ground coriander,1 teaspoon garam masala, Salt to taste, 200g fresh spinach leaves, 1 large onion, finely chopped, 2 tomatoes, finely chopped or pureed,1 tablespoon ginger-garlic paste, 1 teaspoon cumin seeds, 2 green chilies (optional, for extra heat),1 teaspoon ground coriander,1/2 teaspoon garam masala, 1 teaspoon kasseri Methi (dried fenugreek leaves),2 tablespoons cream or yogurt (optional), Salt to taste, 2 tablespoons oil or ghee. ",
            "instructions": [
                "Wash the spinach thoroughly. Boil water in a large pot and blanch the spinach for 2-3 minutes. Immediately transfer the spinach to ice-cold water to retain the green color.  Drain and blend the spinach into a smooth puree. Set aside.",
                " In a bowl, mix the chicken with ginger-garlic paste, turmeric powder, red chili powder, ground coriander, garam masala, and salt. Heat oil or ghee in a large pan, and fry the marinated chicken until browned. Remove and set aside. ",
                "In the same pan, add cumin seeds and let them sizzle. Add the chopped onions and sauté until golden brown. Add ginger-garlic paste and cook until the raw smell disappears. ",
                "Add chopped tomatoes (or tomato puree) and cook until the oil starts separating.  Add green chilies (if using), ground coriander, and salt. Cook for another 2-3 minutes. ",
                " Add the cooked chicken pieces back into the pan and stir. Add the spinach puree and Kasseri Methi. Cover and simmer for 10 minutes, allowing the Flavors to blend. ",
                " Add cream or yogurt for a richer texture (optional). Sprinkle garam masala and mix well.  Serve hot with roti, naan, or steamed rice."
            ],
            "nurtrition": {
               "Calories":"350 kcal",
                "Protein":" 32g",
                "Fat":"18g",
                "Fiber":"4g",
                "Carbohydrates":"10g"
            }
        }
    }

]