[

    {
        "name" :  {
            "id": 7,
            "img": "Dishes Images/Prawn Malai Curry.jpg",
            "Dish": " Prawn Malai Curry",
            "Dishname": "Prawn_Malai_Curry",
            "typeofDish": "Non-Veg",
            "preparationTime": "15 minutes ",
            "cockingTime": "30 minutes ",
            "totalTime": " 45 minutes",
            "Serving": "4 servings",
            "ingredients": "500g prawns (peeled and deveined), 1/2 teaspoon turmeric powder, 1/2 teaspoon red chili powder, 2 tablespoons mustard oil (or vegetable oil),1 large onion, finely chopped, 1 tablespoon ginger-garlic paste, 2 green chilies, slit,1 teaspoon cumin seed, 1/2 teaspoon turmeric powder, 1/2 teaspoon red chili powder, 1 cup coconut milk, 1 tablespoon fresh cream (optional), 2 tablespoons grated coconut (optional), 1 teaspoon garam masala, 2 tablespoons ghee, Fresh coriander leaves for garnish, Salt to taste. 1 tablespoon lemon juice, Salt to taste, ",
            "instructions": [
                " In a bowl, mix the prawns with turmeric, red chili powder, lemon juice, and salt. Let them marinate for 10-15 minutes.",
                "Heat 1 tablespoon mustard oil in a pan. Lightly fry the marinated prawns for 2-3 minutes until they turn pink. Remove from the pan and set aside. ",
                " In the same pan, heat the remaining mustard oil. Add cumin seeds and let them crackle. Add chopped onions and sauté until golden brown. Add ginger-garlic paste and cook until the raw smell disappears.  Add slit green chilies, turmeric powder, and red chili powder, and cook for 2 minutes. ",
                "Add coconut milk and grated coconut (if using) to the onion mixture. Simmer the curry on low heat for 10 minutes, allowing the Flavors to blend. Add salt to taste. ",
                "Gently add the fried prawns to the curry. Cook for another 5-7 minutes, allowing the prawns to soak in the curry. Add fresh cream and garam masala, stirring well. ",
                "Add ghee for extra richness before serving. Garnish with fresh coriander leaves. Serve hot with steamed rice or roti. "
            ],
            "nurtrition": {
                "Calories":"350 kcal",
                "Protein":" 28g",
                "Fat":"20g",
                "Fiber":"2g",
                "Carbohydrates":"8g"
            }
        }
    
    }

   
]